Title: Describing Your Data
Slug: pandas/describing-your-data
Category: Pandas
Tags: info, describe, max, min, sum, count, mean, median, std, corr
Date: 2017-08-05
Modified: 2017-08-05

#### Import libraries

In [2]:
import pandas as pd

#### Create DataFrame

In [18]:
data = {'name': ['Theresa', 'David', 'Gordon', 'Tony', 'John'],
        'colour': ['Blue', 'Blue', 'Red', 'Red', 'Blue'],
        'score1': [1, 5, 5, 3, 5],
        'score2': [None, 3, 7, 5, 7],
        'score3': [None, 5, 6, 9, None]}

df = pd.DataFrame(data)
df

  colour     name  score1  score2  score3
0   Blue  Theresa       1     NaN     NaN
1   Blue    David       5     3.0     5.0
2    Red   Gordon       5     7.0     6.0
3    Red     Tony       3     5.0     9.0
4   Blue     John       5     7.0     NaN

#### DataFrame information

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
colour    5 non-null object
name      5 non-null object
score1    5 non-null int64
score2    4 non-null float64
score3    3 non-null float64
dtypes: float64(2), int64(1), object(2)
memory usage: 280.0+ bytes

#### Basic DataFrame statistics

In [20]:
df.describe()

         score1    score2    score3
count  5.000000  4.000000  3.000000
mean   3.800000  5.500000  6.666667
std    1.788854  1.914854  2.081666
min    1.000000  3.000000  5.000000
25%    3.000000  4.500000  5.500000
50%    5.000000  6.000000  6.000000
75%    5.000000  7.000000  7.500000
max    5.000000  7.000000  9.000000

#### Maximum values

In [21]:
df.max()

colour     Red
name      Tony
score1       5
score2       7
score3       9
dtype: object

#### Minimum values

In [22]:
df.min()

colour     Blue
name      David
score1        1
score2        3
score3        5
dtype: object

#### Sum of values

In [23]:
df.sum()

colour            BlueBlueRedRedBlue
name      TheresaDavidGordonTonyJohn
score1                            19
score2                            22
score3                            20
dtype: object

#### Count non-null values

In [24]:
df.count()

colour    5
name      5
score1    5
score2    4
score3    3
dtype: int64

#### Mean values

In [25]:
df.mean()

score1    3.800000
score2    5.500000
score3    6.666667
dtype: float64

#### Median values

In [26]:
df.median()

score1    5.0
score2    6.0
score3    6.0
dtype: float64

#### Standard deviation of values

In [27]:
df.std()

score1    1.788854
score2    1.914854
score3    2.081666
dtype: float64

#### Correlation matrix

In [28]:
df.corr()

          score1    score2    score3
score1  1.000000  0.174078 -0.970725
score2  0.174078  1.000000  0.240192
score3 -0.970725  0.240192  1.000000